const highLights = [
  {
    img: `content1.jpg`,
    head: `JEFFER เปิดโอกาสให้ทุกคนมาร่วมงาน เพื่อส่งมอบความสำเร็จซึ่งกันและกัน`,
    sub: `การได้ร่วมงานกับองค์กรที่มั่นคง
    พร้อมมอบอาชีพที่ก้าวหน้าเพื่อความสำเร็จของพนักงาน
    หลายคนอาจมองว่าเป็นสิ่งที่หาได้ยาก
    ซึ่งโอกาสพิเศษในวันนี้ JOBBKK ก็ได้สัมภาษณ์
    คุณพิเชษฐ์ เพ็ชรฉ่ำ ผู้อำนวยการฝ่ายทรัพยากรบุคคล
    บริษัท เจฟเฟอร์ เรสโตรองต์ จำกัด
    ธุรกิจร้านอาหารที่ก่อตั้งมา 15 ปี
    โดยมีสาขาในปัจจุบันถึง 76
    สาขาทั่วประเทศและกำลังจะขยายสาขาเพิ่มเติมภายในสิ้นปีนี้
    Jeffer จึงพร้อมเปิดโอกาสให้ทุกคนเข้ามาร่วมงาน
    และอยากให้ทุกคนเปิดโอกาสให้กับองค์กรด้วย
    ซึ่งหากว่าคุณคือคนที่พร้อมมอบโอกาสให้กับ Jeffer
    แล้วนั้น ไปทำความรู้จักกับ Jeffer กันเลย !!!`,
  },
  {
    img: `content2.jpg`,
    head: `Makro ที่หนึ่งในอาเซียน ส่งมอบบริการที่ดีที่สุดแก่ลูกค้า สู่ความสำเร็จของทีมงาน`,
    sub: `เป็นโอกาสที่พิเศษอย่างยิ่งที่ JOBBKK  ได้มีโอกาสสัมภาษณ์ 
    คุณนพคุณ เลียบศิรินนท์ Area Manager และ คุณจินตวัชร์ ชูจินดา Manager – Recruitment  
    บริษัท สยามแม็คโคร จำกัด ( มหาชน ) ศูนย์การค้าส่งที่มีสาขาทั่วประเทศกว่า 100 สาขา และอยู่คู่คนไทยมายาวนานกว่า 28 ปี `,
  },
  {
    img: `content3.jpg`,
    head: `แค่ใจรักสุขภาพ และหลงไหลในการบริการ...ก็มีงานทำแล้ว`,
    sub: `นับเป็นโอกาสพิเศษเป็นอย่างยิ่ง ที่ JOBBKK.COM ได้สัมภาษณ์ คุณ เมษยน เด่นเกรียงไกร 
    Human Resources & Operations Director บริษัท We Fitness Society 
    ซึ่งเป็นบริษัทในเครือ บริษัท เมเจอร์ ซีนีเพล็กซ์ กรุ๊ป จํากัด (มหาชน)  ปัจจุบันมีทั้งหมด 6 สาขาในกรุงเทพฯ 
    และกำลังเปิดรับสมัครงานหลายตำแหน่ง เนื่องจากมีโครงการ การขยายสาขาเพิ่มเติม 
    แน่นอนว่าสิ่งที่พนักงานทุกคนของ We Fitness Society จะได้รับ คือ 
    ความมั่นคงและความก้าวหน้าในสายอาชีพ และสุขภาพที่ดี ส่
    วนคุณสมบัติของผู้ที่จะได้ร่วมเป็นส่วนหนึ่งของ We Fitness Society 
    นั้น เพศ อายุ ประสบการณ์ หรือวุฒิการศึกษาไม่ใช่ประเด็นสำคัญ แต่คุณต้องมี............
    อยากมีงาน และมีความสำเร็จ พร้อมสุขภาพดีเป็นรางวัลพิเศษ ห้ามพลาดเด็ดขาด ! ไปทำความรู้จักกับ We Fitness Society กันเลย !!!`,
  },
  {
    img: `content4.jpg`,
    head: `ร่วมงานกับ “ไทวัสดุ” ได้มากกว่า "เงินเดือน"`,
    sub: ` ถือเป็นโอกาสอันดียิ่งที่ Jobbkk.com ได้มีโอกาสสัมภาษณ์ 
    คุณเรืองเวช วิทวัสการเวช ผู้ช่วยกรรมการผู้จัดการใหญ่ ฝ่ายทรัพยากรบุคคล 
    บริษัท ซีอาร์ซี ไทวัสดุ จำกัด ธุรกิจค้าปลีกของคนไทยในเครือเซ็นทรัล 
    ซึ่งเป็นศูนย์รวมของวัสดุก่อสร้าง วัสดุอุปกรณ์ตกแต่งและซ่อมแซมบ้านอย่างครบวงจรที่มีสาขาถึง 48 สาขาภายในระยะเวลา 7  
    ปีเท่านั้น ซึ่งเชื่อว่าใครๆ ก็ต้องอยากทราบถึงที่มาของความสำเร็จนี้อย่างแน่นอน 
    โดยเฉพาะผู้ที่ต้องการประสบความสำเร็จหรือต้องการเป็นส่วนหนึ่งและเติบโตไปพร้อมกับไทวัสดุ 
    ต้องขอบอกเลยว่าห้ามพลาดเด็ดขาด !!! เพราะคำตอบที่คุณต้องการทราบมีอยู่ที่นี่ที่เดียวเท่านั้น 
    และเพื่อไม่เป็นการเสียเวลา ไปพบกับคำตอบของความสำเร็จกันเลย !`,
  },
  {
    img: `content5.jpg`,
    head: `หน้าที่ของ HR ก็คือ การค้นหาความจริงให้เจอ`,
    sub: `หน้าที่ของคนที่ทำงาน HR ไม่ว่าจะเป็นสรรหาคัดเลือก พัฒนาพนักงาน ค่าจ้างเงินเดือน หรือการสร้างแรงงานสัมพันธ์ที่ดีนั้น 
    ล้วนแต่เป็นหน้าที่ของการค้นหาความจริงให้เจอ เพื่อที่จะได้บริหารจัดการกับความจริงต่างๆ เหล่านั้นได้อย่างมืออาชีพพนักงานที่หางาน 
    หรือทำงานกับบริษัท ส่วนใหญ่มักจะไม่ค่อยเปิดเผยความจริงให้กับนายจ้างทราบเท่าไหร่นัก ดังนั้น HR ที่ทำงานกับคน 
    จึงต้องทำหน้าที่ในการค้นหาความจริง โดยอาศัยวิธีการ หลักการ และแนวทางต่างๆ เพื่อให้เราได้มาซึ่งความจริงของพนักงานนั่นเอง`,
  },
];

const contents = [
  {
    img: `content1.jpg`,
    head: `JEFFER เปิดโอกาสให้ทุกคนมาร่วมงาน เพื่อส่งมอบความสำเร็จซึ่งกันและกัน`,
    sub: `การได้ร่วมงานกับองค์กรที่มั่นคง
    พร้อมมอบอาชีพที่ก้าวหน้าเพื่อความสำเร็จของพนักงาน
    หลายคนอาจมองว่าเป็นสิ่งที่หาได้ยาก
    ซึ่งโอกาสพิเศษในวันนี้ JOBBKK ก็ได้สัมภาษณ์
    คุณพิเชษฐ์ เพ็ชรฉ่ำ ผู้อำนวยการฝ่ายทรัพยากรบุคคล
    บริษัท เจฟเฟอร์ เรสโตรองต์ จำกัด
    ธุรกิจร้านอาหารที่ก่อตั้งมา 15 ปี
    โดยมีสาขาในปัจจุบันถึง 76
    สาขาทั่วประเทศและกำลังจะขยายสาขาเพิ่มเติมภายในสิ้นปีนี้
    Jeffer จึงพร้อมเปิดโอกาสให้ทุกคนเข้ามาร่วมงาน
    และอยากให้ทุกคนเปิดโอกาสให้กับองค์กรด้วย
    ซึ่งหากว่าคุณคือคนที่พร้อมมอบโอกาสให้กับ Jeffer
    แล้วนั้น ไปทำความรู้จักกับ Jeffer กันเลย !!!`,
  },
  {
    img: `content2.jpg`,
    head: `Makro ที่หนึ่งในอาเซียน ส่งมอบบริการที่ดีที่สุดแก่ลูกค้า สู่ความสำเร็จของทีมงาน`,
    sub: `เป็นโอกาสที่พิเศษอย่างยิ่งที่ JOBBKK  ได้มีโอกาสสัมภาษณ์ 
    คุณนพคุณ เลียบศิรินนท์ Area Manager และ คุณจินตวัชร์ ชูจินดา Manager – Recruitment  
    บริษัท สยามแม็คโคร จำกัด ( มหาชน ) ศูนย์การค้าส่งที่มีสาขาทั่วประเทศกว่า 100 สาขา และอยู่คู่คนไทยมายาวนานกว่า 28 ปี `,
  },
  {
    img: `content3.jpg`,
    head: `แค่ใจรักสุขภาพ และหลงไหลในการบริการ...ก็มีงานทำแล้ว`,
    sub: `นับเป็นโอกาสพิเศษเป็นอย่างยิ่ง ที่ JOBBKK.COM ได้สัมภาษณ์ คุณ เมษยน เด่นเกรียงไกร 
    Human Resources & Operations Director บริษัท We Fitness Society 
    ซึ่งเป็นบริษัทในเครือ บริษัท เมเจอร์ ซีนีเพล็กซ์ กรุ๊ป จํากัด (มหาชน)  ปัจจุบันมีทั้งหมด 6 สาขาในกรุงเทพฯ 
    และกำลังเปิดรับสมัครงานหลายตำแหน่ง เนื่องจากมีโครงการ การขยายสาขาเพิ่มเติม 
    แน่นอนว่าสิ่งที่พนักงานทุกคนของ We Fitness Society จะได้รับ คือ 
    ความมั่นคงและความก้าวหน้าในสายอาชีพ และสุขภาพที่ดี ส่
    วนคุณสมบัติของผู้ที่จะได้ร่วมเป็นส่วนหนึ่งของ We Fitness Society 
    นั้น เพศ อายุ ประสบการณ์ หรือวุฒิการศึกษาไม่ใช่ประเด็นสำคัญ แต่คุณต้องมี............
    อยากมีงาน และมีความสำเร็จ พร้อมสุขภาพดีเป็นรางวัลพิเศษ ห้ามพลาดเด็ดขาด ! ไปทำความรู้จักกับ We Fitness Society กันเลย !!!`,
  },
  {
    img: `content4.jpg`,
    head: `ร่วมงานกับ “ไทวัสดุ” ได้มากกว่า "เงินเดือน"`,
    sub: ` ถือเป็นโอกาสอันดียิ่งที่ Jobbkk.com ได้มีโอกาสสัมภาษณ์ 
    คุณเรืองเวช วิทวัสการเวช ผู้ช่วยกรรมการผู้จัดการใหญ่ ฝ่ายทรัพยากรบุคคล 
    บริษัท ซีอาร์ซี ไทวัสดุ จำกัด ธุรกิจค้าปลีกของคนไทยในเครือเซ็นทรัล 
    ซึ่งเป็นศูนย์รวมของวัสดุก่อสร้าง วัสดุอุปกรณ์ตกแต่งและซ่อมแซมบ้านอย่างครบวงจรที่มีสาขาถึง 48 สาขาภายในระยะเวลา 7  
    ปีเท่านั้น ซึ่งเชื่อว่าใครๆ ก็ต้องอยากทราบถึงที่มาของความสำเร็จนี้อย่างแน่นอน 
    โดยเฉพาะผู้ที่ต้องการประสบความสำเร็จหรือต้องการเป็นส่วนหนึ่งและเติบโตไปพร้อมกับไทวัสดุ 
    ต้องขอบอกเลยว่าห้ามพลาดเด็ดขาด !!! เพราะคำตอบที่คุณต้องการทราบมีอยู่ที่นี่ที่เดียวเท่านั้น 
    และเพื่อไม่เป็นการเสียเวลา ไปพบกับคำตอบของความสำเร็จกันเลย !`,
  },
  {
    img: `content5.jpg`,
    head: `หน้าที่ของ HR ก็คือ การค้นหาความจริงให้เจอ`,
    sub: `หน้าที่ของคนที่ทำงาน HR ไม่ว่าจะเป็นสรรหาคัดเลือก พัฒนาพนักงาน ค่าจ้างเงินเดือน หรือการสร้างแรงงานสัมพันธ์ที่ดีนั้น 
    ล้วนแต่เป็นหน้าที่ของการค้นหาความจริงให้เจอ เพื่อที่จะได้บริหารจัดการกับความจริงต่างๆ เหล่านั้นได้อย่างมืออาชีพพนักงานที่หางาน 
    หรือทำงานกับบริษัท ส่วนใหญ่มักจะไม่ค่อยเปิดเผยความจริงให้กับนายจ้างทราบเท่าไหร่นัก ดังนั้น HR ที่ทำงานกับคน 
    จึงต้องทำหน้าที่ในการค้นหาความจริง โดยอาศัยวิธีการ หลักการ และแนวทางต่างๆ เพื่อให้เราได้มาซึ่งความจริงของพนักงานนั่นเอง`,
  },
];

if (loPath === "hrSociety.html") {
  tag = "Hr Society";
} else if (loPath === "knowledge.html") {
  tag = "คลังความรุ้";
} else if (loPath === "inspiration.html") {
  tag = "บุคคลแรงบันดาลใจ";
} else if (loPath === "jobEat.html") {
  tag = "จ๊อบชวนเจี๊ยะ";
} else if (loPath === "vdo.html") {
  tag = "VDO";
} else if (loPath === "lifeStyle.html") {
  tag = "Life Style Worker";
} else if (loPath === "new.html") {
  tag = "ข่าว";
} else if (loPath === "activity.html") {
  tag = "กิจกรรม";
}

let bodyContent = "";

bodyContent += `
  ${/* <!-- ไฮไลท์ เนื้อหาแนะนำ --> */ ""}
  <article class="gridContent">
    ${/* <!-- ไฮไลท์ --> */ ""}
    <div>
      <ul class="articleContentAll">
        ${highLights
          .map(
            (highLight) => `
        <li>
          <figure><img src="images/${highLight.img}" alt="" /></figure>
          <figcaption>
            <div>
              <h6 class="font-weight-bold mb-2 textCut">${highLight.head}</h6>
              <p class="textCut mb-4">${highLight.sub}</p>

              <ul class="tagContent">
                <li>
                  <a href="https://www.jobbkk.com/regional/detail/central/5543/JOBBKK.COM%20%E0%B8%A3%E0%B9%88%E0%B8%A7%E0%B8%A1%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%20SWU%20JOB%20FAIR%202020%20%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%AA%E0%B8%A1%E0%B8%B1%E0%B8%84%E0%B8%A3%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B8%81%E0%B8%A7%E0%B9%88%E0%B8%B2%205,000%20%E0%B8%AD%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%B2" class="fontMark" target="_blank">${tag}</a>
                </li>
              </ul>
            </div>

            <div class="text-right">
              <a
                class="read"
                href="https://www.jobbkk.com/regional/detail/central/5543/JOBBKK.COM%20%E0%B8%A3%E0%B9%88%E0%B8%A7%E0%B8%A1%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%20SWU%20JOB%20FAIR%202020%20%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%AA%E0%B8%A1%E0%B8%B1%E0%B8%84%E0%B8%A3%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B8%81%E0%B8%A7%E0%B9%88%E0%B8%B2%205,000%20%E0%B8%AD%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%B2"
                target="_blank">
                  อ่านต่อ
              </a>
            </div>
          </figcaption>
        </li>
        `
          )
          .join("\n")}
      </ul>

      ${/* pagination */ ""}
      <nav aria-label="Page navigation example">
        <ul class="pagination flexPagination mb-3">
          <li class="page-item">
            <a class="page-link" href="#">Previous</a>
          </li>
          <li class="page-item">
            <a class="page-link active" href="#">1</a>
          </li>
          <li class="page-item">
            <a class="page-link" href="#">2</a>
          </li>
          <li class="page-item">
            <a class="page-link" href="#">3</a>
          </li>
          <li class="page-item">
            <a class="page-link" href="#">Next</a>
          </li>
        </ul>
      </nav>
      ${/* end pagination */ ""}
    </div>
    ${/* <!-- end ไฮไลท์ --> */ ""}

    ${/* <!-- เนื้อหาแนะนำ --> */ ""}
    <div>
      <h2 class="fontHead mb-5">เนื้อหาแนะนำ</h2>
      <ul class="contentRecommentList">
        ${contents
          .map(
            (content) => `
        <li>
          <a
            href="https://www.jobbkk.com/regional/detail/central/5543/JOBBKK.COM%20%E0%B8%A3%E0%B9%88%E0%B8%A7%E0%B8%A1%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%B4%E0%B8%88%E0%B8%81%E0%B8%A3%E0%B8%A3%E0%B8%A1%20SWU%20JOB%20FAIR%202020%20%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B8%AA%E0%B8%A1%E0%B8%B1%E0%B8%84%E0%B8%A3%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B8%81%E0%B8%A7%E0%B9%88%E0%B8%B2%205,000%20%E0%B8%AD%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%B2"
            target="_blank"
          >
            <figure>
              <img src="images/${content.img}" alt="" />
            </figure>
            
            <figcaption>
              <h6 class="font-weight-bold mb-2 textCut">${content.head}</h6>
              <p class="textCut mb-4">${content.sub}</p>
              <div class="text-right">
                <button type="button" class="btn_red readArticle">
                  อ่านต่อ
                </button>
              </div>
            </figcaption>
          </a>
        </li>
        `
          )
          .join("\n")}
      </ul>
    </div>
    ${/* <!-- end เนื้อหาแนะนำ --> */ ""}
  </article>
  ${/* <!-- end ไฮไลท์ เนื้อหาแนะนำ --> */ ""}
`;

document.querySelector(".bodyContent").innerHTML = bodyContent;
